app/helpers/events_helper.rb

SELECT COUNT(*) FROM `userevents` WHERE `userevents`.`user_id` = 1 AND `userevents`.`event_id` = 4
---
  def is_attended
    record = Userevent.where(user_id: current_user.id, event_id: @event.id).count