app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT  `events`.* FROM `events` ORDER BY `events`.`id` ASC LIMIT 1

  def show
    @event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1

  def attend_event
      Userevent.create(user_id: current_user.id,event_id: params[:id])
---
INSERT INTO `userevents` (`user_id`, `event_id`, `created_at`, `updated_at`) VALUES (4, 2, '2020-02-14 14:05:38', '2020-02-14 14:05:38')